In [59]:
import pandas as pd 
import numpy as np
import matplotlib as lyb
import seaborn as sns

In [60]:
data=pd.read_csv("./Data-cleaning-for-beginners-using-pandas.csv")
data.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [61]:
def cleanData(data):

    # min and max salry 
    data["minSalary"]=(data["Salary"]
                       .str.replace("$","",regex=False)
                       .str.replace("k","",regex=False)
                       .str.split("-",expand=True)[0]
                       .astype(int)*1000


                       
                       )
    
    data["maxSalary"]=(data["Salary"]
                       .str.replace("$","",regex=False)
                       .str.replace("k","",regex=False)
                       .str.split("-",expand=True)[1]
                       .astype(int)*1000

    )

    # fix location

    data["Location"]=data["Location"].str.replace(" ",",",1)

    data[["city","country"]]=data["Location"].str.rsplit(",",n=1,expand=True)

    data["city"]=data["city"].str.replace(","," ",1)


    # reeplace -1 to NaN

    data["Easy Apply"]=data["Easy Apply"].str.replace("-1","UNKNOWN")
    data["Rating"]=data["Rating"].replace(-1,np.nan)
    data["Established"]=data["Established"].replace(-1,np.nan)

        # Create experiance level

    data["Experience Level"]=np.where(data["Age"]<30,"Junior",
                                      np.where(data["Age"]<=50,"mid","senior")
                                      )
    

    # Outliner Removal

    Q1=data["Rating"].quantile(0.25)
    Q3=data["Rating"].quantile(0.75)

    IRQ=Q3-Q1

    lower=Q1-1.5*IRQ
    upper=Q3+1.5*IRQ

    data=data[(data["Rating"]>=lower) & (data["Rating"]<=upper)]


    

    data=data.reset_index(drop=True)

    return data

























cleanDataSet=cleanData(data)
cleanDataSet.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,minSalary,maxSalary,city,country,Experience Level
0,0,44.0,$44k-$99k,5.4,"India,In",1999.0,TRUE,44000,99000,India,In,mid
1,1,66.0,$55k-$66k,3.5,"New,York,Ny",2002.0,TRUE,55000,66000,New York,Ny,senior
2,3,64.0,$44k-$99k,4.4,"India,In",1988.0,UNKNOWN,44000,99000,India,In,senior
3,4,25.0,$44k-$99k,6.4,"Australia,Aus",2002.0,UNKNOWN,44000,99000,Australia,Aus,Junior
4,5,44.0,$77k-$89k,1.4,"India,In",1999.0,TRUE,77000,89000,India,In,mid